In [2]:
import math
import pandas as pd
import numpy as np
from sklearn import linear_model

In [3]:
df = pd.read_excel("MultivariateRegressionExercise.xlsx")
df

   experience  test_score  interview_score  salary
0         NaN         8.0                9   50000
1         NaN         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         NaN                7   72000
7        11.0         7.0                8   80000

In [4]:
# Fill the NaN values with zeros for experience
df.experience = df.experience.fillna(0)

In [5]:
df

   experience  test_score  interview_score  salary
0         0.0         8.0                9   50000
1         0.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         NaN                7   72000
7        11.0         7.0                8   80000

In [7]:
#Fill the NaN values with the median value for test score
median_test_score = math.floor(df.test_score.median())
median_test_score

8

In [8]:
df.test_score = df.test_score.fillna(median_test_score)
df

   experience  test_score  interview_score  salary
0         0.0         8.0                9   50000
1         0.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         8.0                7   72000
7        11.0         7.0                8   80000

In [9]:
#Handling missing data process is done:)

In [10]:
#Create an object for regression
reg = linear_model.LinearRegression()
#Train the linear model -- reg.fit(df[[indep. var.]], df.dep. var.)
reg.fit(df[["experience", "test_score", "interview_score"]], df.salary)

LinearRegression()

In [11]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [12]:
reg.intercept_

17737.26346433771

In [13]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [ ]:
reg.predict([[12,10,10]])